<?php

/**
 * Converts numbers in string from western to eastern Arabic numerals.
 *
 * @param  string $str Arbitrary text
 * @return string Text with western Arabic numerals converted into eastern Arabic numerals.
 */
function arabic_w2e($str) {
	$arabic_eastern = array('٠', '١', '٢', '٣', '٤', '٥', '٦', '٧', '٨', '٩');
	$arabic_western = array('0', '1', '2', '3', '4', '5', '6', '7', '8', '9');
	return str_replace($arabic_western, $arabic_eastern, $str);
}

/**
 * Converts numbers from eastern to western Arabic numerals.
 *
 * @param  string $str Arbitrary text
 * @return string Text with eastern Arabic numerals converted into western Arabic numerals.
 */
function arabic_e2w($str) {
	$arabic_eastern = array('٠', '١', '٢', '٣', '٤', '٥', '٦', '٧', '٨', '٩');
	$arabic_western = array('0', '1', '2', '3', '4', '5', '6', '7', '8', '9');
	return str_replace($arabic_eastern, $arabic_western, $str);
}

/*/ Test 
	echo arabic_w2e("1234567890"); // Outputs: ١٢٣٤٥٦٧٨٩٠
	echo arabic_e2w("١٢٣٤٥٦٧٨٩٠"); // Outputs: 1234567890
//*/


function arabic_kelas($number){
	$arabic_kelas = [
		7 => 'السابع',
		8 => 'الثماني',
		9 => 'التاسع',
		10 => 'العاشر',
		11 => 'الثانى العالى',
		12 => '',
	];

	return isset($arabic_kelas[$number]) ? $arabic_kelas[$number] : '';
}

function arabic_character($latin_character){
	$latin_character = strtolower($latin_character);
	$characters = [
		'a' => 'أ',
		'b' => 'ب',
		'c' => 'ج',
		'd' => 'د',
	];

	return isset($characters[$latin_character]) ? $characters[$latin_character] : '';
}

function arabic_terbilang($numeric){

	if(empty($numeric)){
		return;
	}

	$arabic_array = [
		"٠" =>	"صفر",
		"١" =>	"واحدة",
		"٢" =>	"اثنتان",
		"٣" =>	"ثلاث",
		"٤" =>	"أربع",
		"٥" =>	"خمس",
		"٦" =>	"ستّ",
		"٧" =>	"سبع",
		"٨" =>	"ثمان",
		"٩" =>	"تسع",
		"١٠" =>	"عشر",
		"١١" =>	"احدى عشرة",
		"١٢" =>	"اثنتا عشرة",
		"١٣" =>	"ثلاث عشرة",
		"١٤" =>	"أربع عشرة",
		"١٥" =>	"خمس عشرة",
		"١٦" =>	"ستّ عشرة",
		"١٧" =>	"سبع عشرة",
		"١٨" =>	"ثماني عشرة",
		"١٩" =>	"تسع عشرة",
		"٢٠" =>	"عشرون",
		"٢١" =>	"واحدة وعشرون",
		"٢٢" =>	"اثنتان وعشرون",
		"٢٣" =>	"ثلاث وعشرون",
		"٢٤" =>	"أربع وعشرون",
		"٢٥" =>	"خمس وعشرون",
		"٢٦" =>	"ستّ وعشرون",
		"٢٧" =>	"سبع وعشرون",
		"٢٨" =>	"ثمان وعشرون",
		"٢٩" =>	"تسع وعشرون",
		"٣٠" =>	"ثلاثون",
		"٣١" =>	"واحدة وثلاثون",
		"٣٢" =>	"اثنتان وثلاثون",
		"٣٣" =>	"ثلاث وثلاثون",
		"٣٤" =>	"أربع وثلاثون",
		"٣٥" =>	"خمس وثلاثون",
		"٣٦" =>	"ستّ وثلاثون",
		"٣٧" =>	"سبع وثلاثون",
		"٣٨" =>	"ثمان وثلاثون",
		"٣٩" =>	"تسع وثلاثون",
		"٤٠" =>	"أربعون",
		"٤١" =>	"واحدة وأربعون",
		"٤٢" =>	"اثنتان وأربعون",
		"٤٣" =>	"ثلاث وأربعون",
		"٤٤" =>	"أربع وأربعون",
		"٤٥" =>	"خمس وأربعون",
		"٤٦" =>	"ستّ وأربعون",
		"٤٧" =>	"سبع وأربعون",
		"٤٨" =>	"ثمان وأربعون",
		"٤٩" =>	"تسع وأربعون",
		"٥٠" =>	"خمسون",
		"٥١" =>	"واحدة وخمسون",
		"٥٢" =>	"اثنتان وخمسون",
		"٥٣" =>	"ثلاث وخمسون",
		"٥٤" =>	"أربع وخمسون",
		"٥٥" =>	"خمس وخمسون",
		"٥٦" =>	"ستّ وخمسون",
		"٥٧" =>	"سبع وخمسون",
		"٥٨" =>	"ثمان وخمسون",
		"٥٩" =>	"تسع وخمسون",
		"٦٠" =>	"ستّون",
		"٦١" =>	"واحدة وستّون",
		"٦٢" =>	"اثنتان وستّون",
		"٦٣" =>	"ثلاث وستّون",
		"٦٤" =>	"أربع وستّون",
		"٦٥" =>	"خمس وستّون",
		"٦٦" =>	"ستّ وستّون",
		"٦٧" =>	"سبع وستّون",
		"٦٨" =>	"ثمان وستّون",
		"٦٩" =>	"تسع وستّون",
		"٧٠" =>	"سبعون",
		"٧١" =>	"واحدة وسبعون",
		"٧٢" =>	"اثنتان  وسبعون",
		"٧٣" =>	"ثلاث وسبعون",
		"٧٤" =>	"أربع وسبعون",
		"٧٥" =>	"خمس وسبعون",
		"٧٦" =>	"ستّ وسبعون",
		"٧٧" =>	"سبع وسبعون",
		"٧٨" =>	"ثمان وسبعون",
		"٧٩" =>	"تسع وسبعون",
		"٨٠" =>	"ثمانون",
		"٨١" =>	"واحدة وثمانون",
		"٨٢" =>	"اثنتان وثمانون",
		"٨٣" =>	"ثلاث وثمانون",
		"٨٤" =>	"أربع وثمانون",
		"٨٥" =>	"خمس وثمانون",
		"٨٦" =>	"ستّ وثمانون",
		"٨٧" =>	"سبع وثمانون",
		"٨٨" =>	"ثمان وثمانون",
		"٨٩" =>	"تسع وثمانون",
		"٩٠" =>	"تسعون",
		"٩١" =>	"واحدة وتسعون",
		"٩٢" =>	"اثنتان وتسعون",
		"٩٣" =>	"ثلاث وتسعون",
		"٩٤" =>	"أربع وتسعون",
		"٩٥" =>	"خمس وتسعون",
		"٩٦" =>	"ستّ وتسعون",
		"٩٧" =>	"سبع وتسعون",
		"٩٨" =>	"ثمان وتسعون",
		"٩٩" =>	"تسع وتسعون",
		"١٠٠" =>	"مائة",
	];

	return $arabic_array[arabic_w2e($numeric)];
}


function arabic_terbilang_juz($numeric){

	if(empty($numeric)){
		return;
	}

	$arabic_array = [
		"٠" =>	"صفر",
		"١" =>	"واحدة",
		"٢" =>	"اثنتان",
		"٣" =>	"ثلاث",
		"٤" =>	"أربع",
		"٥" =>	"خمس",
		"٦" =>	"ستّ",
		"٧" =>	"سبع",
		"٨" =>	"ثمان",
		"٩" =>	"تسع",
		"١٠" =>	"عشر",
		"١١" =>	"احدى عشرة",
		"١٢" =>	"اثنتا عشرة",
		"١٣" =>	"ثلاث عشرة",
		"١٤" =>	"أربع عشرة",
		"١٥" =>	"خمس عشرة",
		"١٦" =>	"ستّ عشرة",
		"١٧" =>	"سبع عشرة",
		"١٨" =>	"ثماني عشرة",
		"١٩" =>	"تسع عشرة",
		"٢٠" =>	"عشرون",
		"٢١" =>	"واحدة وعشرون",
		"٢٢" =>	"اثنتان وعشرون",
		"٢٣" =>	"ثلاث وعشرون",
		"٢٤" =>	"أربع وعشرون",
		"٢٥" =>	"خمس وعشرون",
		"٢٦" =>	"ستّ وعشرون",
		"٢٧" =>	"سبع وعشرون",
		"٢٨" =>	"ثمان وعشرون",
		"٢٩" =>	"تسع وعشرون",
		"٣٠" =>	"ثلاثون",
		"٣١" =>	"واحدة وثلاثون",
		"٣٢" =>	"اثنتان وثلاثون",
		"٣٣" =>	"ثلاث وثلاثون",
		"٣٤" =>	"أربع وثلاثون",
		"٣٥" =>	"خمس وثلاثون",
		"٣٦" =>	"ستّ وثلاثون",
		"٣٧" =>	"سبع وثلاثون",
		"٣٨" =>	"ثمان وثلاثون",
		"٣٩" =>	"تسع وثلاثون",
		"٤٠" =>	"أربعون",
		"٤١" =>	"واحدة وأربعون",
		"٤٢" =>	"اثنتان وأربعون",
		"٤٣" =>	"ثلاث وأربعون",
		"٤٤" =>	"أربع وأربعون",
		"٤٥" =>	"خمس وأربعون",
		"٤٦" =>	"ستّ وأربعون",
		"٤٧" =>	"سبع وأربعون",
		"٤٨" =>	"ثمان وأربعون",
		"٤٩" =>	"تسع وأربعون",
		"٥٠" =>	"خمسون",
		"٥١" =>	"واحدة وخمسون",
		"٥٢" =>	"اثنتان وخمسون",
		"٥٣" =>	"ثلاث وخمسون",
		"٥٤" =>	"أربع وخمسون",
		"٥٥" =>	"خمس وخمسون",
		"٥٦" =>	"ستّ وخمسون",
		"٥٧" =>	"سبع وخمسون",
		"٥٨" =>	"ثمان وخمسون",
		"٥٩" =>	"تسع وخمسون",
		"٦٠" =>	"ستّون",
		"٦١" =>	"واحدة وستّون",
		"٦٢" =>	"اثنتان وستّون",
		"٦٣" =>	"ثلاث وستّون",
		"٦٤" =>	"أربع وستّون",
		"٦٥" =>	"خمس وستّون",
		"٦٦" =>	"ستّ وستّون",
		"٦٧" =>	"سبع وستّون",
		"٦٨" =>	"ثمان وستّون",
		"٦٩" =>	"تسع وستّون",
		"٧٠" =>	"سبعون",
		"٧١" =>	"واحدة وسبعون",
		"٧٢" =>	"اثنتان  وسبعون",
		"٧٣" =>	"ثلاث وسبعون",
		"٧٤" =>	"أربع وسبعون",
		"٧٥" =>	"خمس وسبعون",
		"٧٦" =>	"ستّ وسبعون",
		"٧٧" =>	"سبع وسبعون",
		"٧٨" =>	"ثمان وسبعون",
		"٧٩" =>	"تسع وسبعون",
		"٨٠" =>	"ثمانون",
		"٨١" =>	"واحدة وثمانون",
		"٨٢" =>	"اثنتان وثمانون",
		"٨٣" =>	"ثلاث وثمانون",
		"٨٤" =>	"أربع وثمانون",
		"٨٥" =>	"خمس وثمانون",
		"٨٦" =>	"ستّ وثمانون",
		"٨٧" =>	"سبع وثمانون",
		"٨٨" =>	"ثمان وثمانون",
		"٨٩" =>	"تسع وثمانون",
		"٩٠" =>	"تسعون",
		"٩١" =>	"واحدة وتسعون",
		"٩٢" =>	"اثنتان وتسعون",
		"٩٣" =>	"ثلاث وتسعون",
		"٩٤" =>	"أربع وتسعون",
		"٩٥" =>	"خمس وتسعون",
		"٩٦" =>	"ستّ وتسعون",
		"٩٧" =>	"سبع وتسعون",
		"٩٨" =>	"ثمان وتسعون",
		"٩٩" =>	"تسع وتسعون",
		"١٠٠" =>	"مائة",
	];

	return $arabic_array[arabic_w2e($numeric)] . 'جزاء ';
}

